DataProcessors/бит_СозданиеКвартирИЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_СозданиеКвартирИЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервогоДома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоследнегоДома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяУлица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийКорпус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоЗданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервойКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоКвартир</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРассчитанныйНомерЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервогоЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корпус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКвартир</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корпус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКвартиры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_СозданиеКвартирИЛицевыхСчетов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НомерПервогоДома = 1;
	Объект.НомерПоследнегоДома = 10;  	
	Объект.НомерПервойКвартиры = 1;
	Объект.ДатаСоздания = ТекущаяДата();
	
	ПравилаНумерацииЖил = "НомерДомаКвартира";

	Элементы.ПравилаНумерацииЖил.СписокВыбора.Очистить();
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("Квартира","По номеру квартиры",, БиблиотекаКартинок.бит_ОПрограмме);
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("ПоПорядку","Последовательная нумерация",, БиблиотекаКартинок.бит_Реквизиты);
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("НомерДомаКвартира","Номер дома + Квартира",, БиблиотекаКартинок.бит_ПодомовойУчет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокЗданий(Команда)
	
	если Объект.НомерПервогоДома >= Объект.НомерПоследнегоДома тогда	
		
	  ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.НомерПоследнегоДома;
	  Сообщить("Номер последнего дома должен быть больше номера первого дома.");
		
	конецесли;	
	
  //если Объект.Организация <> Справочники.Организации.ПустаяСсылка() тогда	
    Объект.СписокЗданий.Очистить();
	ЗаполнитьСписокЗданийНаСервере();
  //иначе	
  //  Сообщить("Не заполнено поле Организация");
  //конецесли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗданийНаСервере()
  
   если Объект.Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() тогда	
	Сообщить("Не заполнено поле Улица");
	возврат;
   конецесли;	

   если Объект.Организация = Справочники.Организации.ПустаяСсылка() тогда	
	Сообщить("Не заполнено поле Организация");
	возврат;
   конецесли;	
   
	текущийНомерДома = Объект.НомерПервогоДома; 
	для НомерДома = Объект.НомерПервогоДома по Объект.НомерПоследнегоДома цикл
		
	  новыйДом = Объект.СписокЗданий.Добавить();	
	  новыйДом.Улица = Объект.Улица;
	  новыйДом.Организация = Объект.Организация;
	  новыйДом.Дом = текущийНомерДома;
	  новыйДом.Ссылка = НайтиОбъектЗдания(Объект.Улица, новыйДом.Дом);
	  	  
	  текущийНомерДома = текущийНомерДома + 1;
		
	конеццикла;	
	
	Объект.СписокЗданий.Сортировать("Улица, Дом, Корпус");
  	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СписокЗданий.Сортировать("Улица, Дом, Корпус");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКорпуса(Команда)
	
  Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);
 
  ПоказатьВводЗначения( Оповещение, , "Введите количество корпусов", "Число");

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт
 Если Не Результат = Неопределено Тогда
	 
  текущийКорпус = 1; 
  для НомерДома = 1 по Результат цикл
		
	  новыйДом = Объект.СписокЗданий.Добавить();	
	  новыйДом.Улица = Объект.ТекущаяУлица;
	  новыйДом.Организация = Объект.Организация;
	  новыйДом.Дом = Объект.текущийДом;
	  новыйДом.Корпус = текущийКорпус;
	  
	  текущийКорпус = текущийКорпус + 1;
		
  конеццикла;	 
  
  Объект.СписокЗданий.Сортировать("Улица, Дом, Корпус");
		
 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПриАктивизацииСтроки(Элемент)
	
  если Элемент.ТекущиеДанные <> неопределено тогда	
	Объект.ТекущаяУлица = Элемент.ТекущиеДанные.Улица;
	Объект.ТекущийДом = Элемент.ТекущиеДанные.Дом;
	Объект.ТекущийКорпус = Элемент.ТекущиеДанные.Корпус;
	Объект.ТекущаяОрганизация = Элемент.ТекущиеДанные.Организация;
	Объект.ТекущаяСсылка = Элемент.ТекущиеДанные.Ссылка;
	
	НайтиКвартирыПоАдресуНаСервере();
  конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКвартиры(Команда)
	
 если Элементы.СписокЗданий.ВыделенныеСтроки.Количество() = 0 тогда	
	Сообщить("Выберите здание в которых создаются квартиры и ЛС.");
	возврат;
 конецесли;		
	
 СоздатьЗданиеНаСервере();

 // одиночный выбор	
 если Элементы.СписокЗданий.ВыделенныеСтроки.Количество() = 1 тогда  	
		
  Объект.ПоследнийРассчитанныйНомерЛС = 0;
  если строка(Объект.ТекущаяУлица) <> "" тогда	
	
	  текущийНомерКвартиры = Объект.НомерПервойКвартиры;//НайтиПоследнийНомерКвартиры();
	  Объект.СписокКвартир.Очистить();
	  для НомерКвартиры = 1 по Объект.КолвоКвартир цикл
			
		  новыйКвартира = Объект.СписокКвартир.Добавить();	
		  новыйКвартира.Улица = Объект.ТекущаяУлица;
		  новыйКвартира.Дом = Объект.ТекущаяСсылка;
		  новыйКвартира.Корпус = Объект.ТекущийКорпус;
		  новыйКвартира.НомерКвартиры = текущийНомерКвартиры;    		  
		  новыйКвартира.ТипКвартиры = Объект.ТипКвартиры;
		  новыйКвартира.СтатусКвартиры = Объект.СтатусКвартиры; 		  
		  новыйКвартира.ЛицевойСчет = СформироватьНомерЛС(Объект.ТекущийДом, текущийНомерКвартиры, Объект.ПрефиксЛС, Объект.ПостфиксЛС, Объект.ДлинаЛС);
		  новыйКвартира.СтатусЛС = "Новый";
		  
		  текущийНомерКвартиры = текущийНомерКвартиры + 1;
			
	  конеццикла;	 
	  
	  Объект.СписокКвартир.Сортировать("Улица, Дом, Корпус, НомерКвартиры"); 	  
	  Объект.НомерПервойКвартиры = текущийНомерКвартиры;
  конецесли;
 иначе // на всех
	 
   Объект.СписокКвартир.Очистить();
   
   для каждого стр из Элементы.СписокЗданий.ВыделенныеСтроки цикл
	   
     текущийНомерКвартиры = объект.НомерПервойКвартиры;
     ТекущиеДанныеСИдентификатора = Элементы.СписокЗданий.ДанныеСтроки(стр);

	 если объект.КолвоКвартир = 0 тогда 
		 
	   новыйКвартира = Объект.СписокКвартир.Добавить();	
	   новыйКвартира.Улица = ТекущиеДанныеСИдентификатора.Улица;
	   новыйКвартира.Дом = ТекущиеДанныеСИдентификатора.Ссылка;
	   новыйКвартира.Корпус = ТекущиеДанныеСИдентификатора.Корпус;
	   новыйКвартира.НомерКвартиры = текущийНомерКвартиры;    		  
	   новыйКвартира.ТипКвартиры = Объект.ТипКвартиры;
	   новыйКвартира.СтатусКвартиры = Объект.СтатусКвартиры; 
	   новыйКвартира.ЛицевойСчет = СформироватьНомерЛС(ТекущиеДанныеСИдентификатора.Ссылка, текущийНомерКвартиры, Объект.ПрефиксЛС, Объект.ПостфиксЛС, Объект.ДлинаЛС);
	   новыйКвартира.СтатусЛС = "Новый";			 
		 
	 иначе	 
		 для ном = 1 по объект.КолвоКвартир цикл		   
		  	  
		  новыйКвартира = Объект.СписокКвартир.Добавить();	
		  новыйКвартира.Улица = ТекущиеДанныеСИдентификатора.Улица;
		  новыйКвартира.Дом = ТекущиеДанныеСИдентификатора.Ссылка;
		  новыйКвартира.Корпус = ТекущиеДанныеСИдентификатора.Корпус;
		  новыйКвартира.НомерКвартиры = текущийНомерКвартиры;    		  
		  новыйКвартира.ТипКвартиры = Объект.ТипКвартиры;
		  новыйКвартира.СтатусКвартиры = Объект.СтатусКвартиры; 		  
		  новыйКвартира.ЛицевойСчет = СформироватьНомерЛС(ТекущиеДанныеСИдентификатора.Ссылка, текущийНомерКвартиры, Объект.ПрефиксЛС, Объект.ПостфиксЛС, Объект.ДлинаЛС);
		  новыйКвартира.СтатусЛС = "Новый";
			  
		  текущийНомерКвартиры = текущийНомерКвартиры + 1;
		  
	     конеццикла;  	  
    конецесли;
   конеццикла;	
 
   Объект.СписокКвартир.Сортировать("Улица, Дом, Корпус, НомерКвартиры"); 	  
   Объект.НомерПервойКвартиры = текущийНомерКвартиры;

 конецесли;
 
   Объект.ПоследнийРассчитанныйНомерЛС = 0;

КонецПроцедуры


Функция НайтиПоследнийНомерКвартиры()

 таблицаКвартир = Объект.СписокКвартир.Выгрузить();	
	
 если таблицаКвартир.Количество() = 0 тогда
  возврат 1;
 иначе
	 
  Объект.СписокКвартир.Сортировать("Улица, Дом, Корпус, НомерКвартиры");

  НомераКвартир = таблицаКвартир.ВыгрузитьКолонку("НомерКвартиры"); 	 
  возврат НомераКвартир[НомераКвартир.Количество()-1] + 1;  
  
 конецесли;	 

КонецФункции // НайтиПоследнийНомер()

&НаКлиенте
Процедура СоздатьЗдание(Команда)
	СоздатьЗданиеНаСервере();
КонецПроцедуры

функция НайтиОбъектЗдания (Улица, Дом, Корпус = неопределено)
	
    запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_СписокЗданий.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |ГДЕ
	               |	бит_СписокЗданий.Улица = &Улица
	               |	И бит_СписокЗданий.НомерДома = &НомерДома";
	
	если Корпус <> неопределено и Корпус <> 0 тогда	
	   запрос.Текст = запрос.Текст + " И бит_СписокЗданий.Корпус = &Корпус";
	   запрос.УстановитьПараметр("Корпус", Корпус);
	конецесли;
	запрос.УстановитьПараметр("Улица", Улица);
	запрос.УстановитьПараметр("НомерДома", Число(Дом));	

    табЗапроса = запрос.Выполнить().Выгрузить();

	если табЗапроса.Количество() = 0 тогда 
	 возврат неопределено; 	
	иначе	
	 возврат табЗапроса[0].Ссылка;	
	конецесли	
	
конецфункции	

функция НайтиОбъектКвартира (Владелец, НомерКвартиры)
	
   Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_Квартиры.Ссылка
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|ГДЕ
	|	бит_Квартиры.Наименование = &Наименование
	|	И бит_Квартиры.Владелец = &Владелец";
//	|	И бит_Квартиры.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", строка(НомерКвартиры));
	Запрос.УстановитьПараметр("Владелец",Владелец);
//	Запрос.УстановитьПараметр("Ссылка",Ссылка);

	//
	//запрос.УстановитьПараметр("Владелец", Владелец);
	//запрос.УстановитьПараметр("НомерКвартиры", НомерКвартиры);
    табЗапроса = запрос.Выполнить().Выгрузить();
	
	если табЗапроса.Количество() = 0 тогда 
	  возврат неопределено; 	
    иначе	
	  возврат табЗапроса[0].Ссылка;
	конецесли;	
   
 возврат неопределено; 	
конецфункции	

функция НайтиОбъектЛС (Здание, Квартира)
	
 если ТипЗнч(Квартира) = Тип("Число") тогда
	
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
                 |ИЗ
                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
                 |ГДЕ
                 |	бит_ЛицевыеСчета.Здание = &Здание
                 |	И бит_ЛицевыеСчета.Квартира.НомерКвартиры = &Квартира";
   
 иначе 
	 
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
                 |ИЗ
                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
                 |ГДЕ
                 |	бит_ЛицевыеСчета.Здание = &Здание
                 |	И бит_ЛицевыеСчета.Квартира = &Квартира";
	  	 
 конецесли;	 
 
 запрос.УстановитьПараметр("Здание", Здание);
 запрос.УстановитьПараметр("Квартира", Квартира);
 табЗапроса = запрос.Выполнить().Выгрузить(); 
 
 если табЗапроса.Количество() = 0 тогда 

    табЗапроса = запрос.Выполнить().Выгрузить();

	если табЗапроса.Количество() = 0 тогда 
	 возврат неопределено; 	
	иначе	
	 возврат табЗапроса[0].Ссылка;	
    конецесли;	
	
 иначе		 
	возврат табЗапроса[0].Ссылка;   	
 конецесли;	

 возврат неопределено;   
 
конецфункции	

&НаСервере
Процедура СоздатьЗданиеНаСервере()
	
  Объект.НомерПервогоЛС = НайтиПоследнийПорядковыйНомерЛС();	  
	
  для каждого стр из Объект.СписокЗданий цикл			
	
	  если НайтиОбъектЗдания (стр.Улица, стр.Дом, стр.Корпус) = неопределено тогда 
		  
		НовоеЗдание = Справочники.бит_СписокЗданий.СоздатьЭлемент();
		
		НовоеЗдание.Улица       = стр.Улица;
		НовоеЗдание.НомерДома   = стр.Дом;
		если стр.Корпус <> 0 тогда
		 НовоеЗдание.Корпус      = стр.Корпус;
		конецесли;
		НовоеЗдание.Организация = стр.Организация;
		НовоеЗдание.Прочее      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("Автоматическое создание %1"), ТекущаяДата());
		
		Попытка
			НовоеЗдание.Записать();	
			стр.Ссылка = НовоеЗдание.Ссылка; 
		Исключение		
			рез = ОписаниеОшибки();
		КонецПопытки; 
		
	конецесли;
	
  конеццикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАвтоматические(Команда)
	УдалитьАвтоматическиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьАвтоматическиеНаСервере()
	
	ОбщееКолвоНайденных = 0;
	КолвоУдаленных = 0;
	
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	               |	бит_ЛицевыеСчета.Комментарий КАК Комментарий
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |ГДЕ
	               |	бит_ЛицевыеСчета.Комментарий ПОДОБНО &Прочее";
	
	запрос.УстановитьПараметр("Прочее", "%Автоматическое создание%");   	
	
    табЗапроса = запрос.Выполнить().Выгрузить();
	ОбщееКолвоНайденных = табЗапроса.Количество();
	КолвоУдаленных = 0;
	для каждого стр из табЗапроса цикл		
	 
	  датаСоздания = ПолучитьДатуСоздания (стр.Комментарий);	  
	  если датаСоздания <> '00010101000000' и ДатаВИнтервале(датаСоздания) тогда		  
		об = стр.Ссылка.ПолучитьОбъект();
	    об.ПометкаУдаления = истина;
	    об.Записать();	
		КолвоУдаленных = КолвоУдаленных + 1;
	  конецесли;	      		
	  		
    конеццикла;

	строкаРезультата = Строка("Найдено ЛС: " + строка(ОбщееКолвоНайденных) + " , удалено: " + строка(КолвоУдаленных));
	Сообщить(строкаРезультата);

	
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_Квартиры.Ссылка КАК Ссылка,
	               |	бит_Квартиры.Комментарий КАК Комментарий
	               |ИЗ
	               |	Справочник.бит_Квартиры КАК бит_Квартиры
	               |ГДЕ
	               |	бит_Квартиры.Комментарий ПОДОБНО &Прочее";
	
	запрос.УстановитьПараметр("Прочее", "%Автоматическое создание%"); 	
	
    табЗапроса = запрос.Выполнить().Выгрузить();
	ОбщееКолвоНайденных = табЗапроса.Количество();
	КолвоУдаленных = 0;
	для каждого стр из табЗапроса цикл
		
	  датаСоздания = ПолучитьДатуСоздания (стр.Комментарий);	  
	  если датаСоздания <> '00010101000000' и ДатаВИнтервале(датаСоздания) тогда
	   об = стр.Ссылка.ПолучитьОбъект();
	   об.ПометкаУдаления = истина;
	   об.Записать();
	   КолвоУдаленных = КолвоУдаленных + 1;
	  конецесли;	   
		
    конеццикла;	
	
	строкаРезультата = Строка("Найдено Квартир: " + строка(ОбщееКолвоНайденных) + " , удалено: " + строка(КолвоУдаленных));
	Сообщить(строкаРезультата);

	
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_СписокЗданий.Ссылка КАК Ссылка,
	               |	бит_СписокЗданий.Прочее КАК Прочее
	               |ИЗ
	               |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	               |ГДЕ
	               |	бит_СписокЗданий.Прочее ПОДОБНО &Прочее";
	
	запрос.УстановитьПараметр("Прочее", "%Автоматическое создание%");	
	
    табЗапроса = запрос.Выполнить().Выгрузить();
	ОбщееКолвоНайденных = табЗапроса.Количество();
	КолвоУдаленных = 0;
	для каждого стр из табЗапроса цикл
		
	 датаСоздания = ПолучитьДатуСоздания (стр.Прочее);
	 если датаСоздания <> '00010101000000' и ДатаВИнтервале(датаСоздания) тогда
	  об = стр.Ссылка.ПолучитьОбъект();
	  об.ПометкаУдаления = истина;
	  об.Записать();
	  КолвоУдаленных = КолвоУдаленных + 1;
     конецесли;
  
    конеццикла;  
	
	строкаРезультата = Строка("Найдено Зданий: " + строка(ОбщееКолвоНайденных) + " , удалено: " + строка(КолвоУдаленных));
	Сообщить(строкаРезультата);
	
	Объект.СписокЗданий.Очистить();
    Объект.СписокКвартир.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьКвартиру(Команда)
	
 если ЗначениеЗаполнено(Объект.ДатаСоздания) = ложь тогда
	Объект.ДатаСоздания = ТекущаяДата(); 	
 конецесли;		
	
 если Элементы.СписокЗданий.ТекущиеДанные <> неопределено или Элементы.СписокЗданий.ВыделенныеСтроки.Количество() <> 0 тогда	
  СоздатьКвартируНаСервере(истина);	
//  Объект.НомерПервогоЛС = НайтиПоследнийПорядковыйНомерЛС();
 иначе
  Сообщить("Не выбрано здание");
 конецесли; 

КонецПроцедуры

&НаСервере
Процедура СоздатьКвартируНаСервере(СоздаватьЛС)
  // лог-файл в Excel	
  //Макет = ПолучитьМакетНаСервере();	
  //ТабДок = новый ТабличныйДокумент;
  //ЗаписатьШапку (Макет, ТабДок);  
    
//  если Владелец = справочники.бит_СписокЗданий.ПустаяСсылка() тогда	
//   Владелец = СоздатьОбъектЗданиеНаСервере(Объект.ТекущаяУлица, Объект.ТекущийДом, Объект.ТекущийКорпус, Объект.Организация);  
//  конецесли;	
	
    для каждого стр из Объект.СписокКвартир цикл			
	  
	 Владелец = НайтиВладельцаКвартиры(стр.Улица, стр.Дом, стр.Корпус);  
	 если Владелец = неопределено тогда	
      Владелец = СоздатьОбъектЗданиеНаСервере(стр.Улица, стр.Дом, стр.Корпус, Объект.Организация);  
     конецесли;
 
	 объектКвартира = НайтиОбъектКвартира(Владелец, стр.НомерКвартиры);   
	 если объектКвартира = неопределено тогда 
		
		НовыйЭлемент = Справочники.бит_Квартиры.СоздатьЭлемент();
			
	    НовыйЭлемент.Владелец      = Владелец.Ссылка;
 	    НовыйЭлемент.НомерКвартиры = стр.НомерКвартиры;
		если НовыйЭлемент.НомерКвартиры = 0 тогда 
		 НовыйЭлемент.ПрефиксКвартиры = "-";
	    иначе
		 НовыйЭлемент.ПрефиксКвартиры = объект.ПрефиксКвартиры;
		конецесли; 
	    НовыйЭлемент.Наименование  = Строка(стр.НомерКвартиры);
		НовыйЭлемент.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("Автоматическое создание в %1"), ТекущаяДата());
						
	    Попытка
		
		  НовыйЭлемент.Записать();
		  Квартира = НовыйЭлемент.Ссылка; 
		  
		  НовыйНабор = РегистрыСведений.бит_СведенияОКвартире.СоздатьНаборЗаписей();
		  НовыйНабор.Отбор.Квартира.Установить(Квартира);
		  НовыйНабор.Прочитать();
		
		  НоваяЗапись = НовыйНабор.Добавить();
		
		  НоваяЗапись.Период         = НачалоМесяца(Объект.ДатаСоздания);
		  НоваяЗапись.Квартира       = Квартира.Ссылка;
		  НоваяЗапись.СтатусКвартиры = стр.СтатусКвартиры;
		  НоваяЗапись.ТипКвартиры    = стр.ТипКвартиры;
		
		  Попытка
			  
			НовыйНабор.Записать();
			
			 // лог-файл в Excel	
			//структураЗаписи = новый Структура();
			//структураЗаписи.Вставить("Здание", НовыйЭлемент.Владелец);
			//структураЗаписи.Вставить("Квартира", Квартира.Ссылка);
           	//ЗаписатьСтроку (Макет, ТабДок, структураЗаписи);
			
		  Исключение
			 Сообщить(ОписаниеОшибки());
		  КонецПопытки;      
		  
		  если СоздаватьЛС = истина тогда
			  
			  объектЛС = НайтиОбъектЛС(Владелец, стр.НомерКвартиры); 
			  если объектЛС = неопределено тогда 
				Номер = стр.ЛицевойСчет;//СформироватьНомерЛС(Владелец, стр.НомерКвартиры, Объект.ПрефиксЛС, Объект.ДлинаЛС);
				стр.СтатусЛС = СоздатьЛицевойСчетНаСервере(Владелец, Квартира, Объект.ТипКвартиры, Объект.СтатусКвартиры, Объект.ТекущаяОрганизация, Объект.ТекущаяУлица, Номер);  
			  иначе	
			    стр.ЛицевойСчет = объектЛС;//.Наименование; 	
	  	      конецесли;	  
			  
		  конецесли;	  
			  
	    Исключение		
		  //Сообщить(ОписаниеОшибки());
	    КонецПопытки;
	 иначе
		если СоздаватьЛС = истина тогда
			 
			  объектЛС = НайтиОбъектЛС(Владелец, стр.НомерКвартиры); 
			  если объектЛС = неопределено тогда 
				Номер = стр.ЛицевойСчет;//СформироватьНомерЛС(Владелец, стр.НомерКвартиры, Объект.ПрефиксЛС, Объект.ДлинаЛС);
				стр.СтатусЛС = СоздатьЛицевойСчетНаСервере(Владелец, объектКвартира, Объект.ТипКвартиры, Объект.СтатусКвартиры, Объект.ТекущаяОрганизация, стр.Улица, Номер);  
			  иначе	
			    стр.ЛицевойСчет = объектЛС; 
				стр.СтатусЛС = "У квартиры уже есть ЛС";
	  	      конецесли;	  
			  
		конецесли;	 
	 конецесли;
  конеццикла;	
  
  // лог-файл в Excel	
  //СтрокаИмениФайла = "_СозданиеЗданий";
  //ПутьФайла = строка("D:\Проверка\");
  //ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(строка(ТекущаяДата()), "");
  //ПутьФайла = ПутьФайла + ИмяФайла; 
  //ПутьФайла =  ПутьФайла + СтрокаИмениФайла + ".xls";
  //ТабДок.Записать(ПутьФайла, ТипФайлаТабличногоДокумента.XLS);
 	
КонецПроцедуры

Функция НайтиВладельцаКвартиры(Улица, Дом, Корпус)

 запрос = новый запрос;
 запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                |	бит_СписокЗданий.Ссылка КАК Ссылка
                |ИЗ
                |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
                |ГДЕ
                |	бит_СписокЗданий.Улица = &Улица
                |	И бит_СписокЗданий.НомерДома = &НомерДома
                |	И бит_СписокЗданий.Корпус = &Корпус";
 
 запрос.УстановитьПараметр("Улица", Улица);
 запрос.УстановитьПараметр("НомерДома", Дом);
 запрос.УстановитьПараметр("Корпус", Корпус);

 табЗапроса = запрос.Выполнить().Выгрузить(); 
 
 если табЗапроса.Количество() > 0 тогда
	 возврат табЗапроса[0].Ссылка;
 иначе 
	 возврат неопределено;
 конецесли; 	

КонецФункции


//&НаКлиенте
//Процедура СоздатьЛС(Команда)
//	СоздатьЛСНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура СоздатьЛСНаСервере()
//КонецПроцедуры

&НаСервере
функция СоздатьЛицевойСчетНаСервере(Здание, Квартира, ТипКвартиры, СтатусКвартиры, Организация, УлицаЛицевогоСчета, Номер)
	
  ЛС = НайтиОбъектЛС (Здание, Квартира);
	
  если ЛС = неопределено тогда  	
	
	НовыйЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент();
	НовыйЛС.УстановитьНовыйКод();
	НовыйЛС.Квартира = Квартира;
	НовыйЛС.Здание   = Здание;
	НовыйЛС.Организация = Организация;
	НовыйЛС.УлицаЛицевогоСчета = УлицаЛицевогоСчета;
	НовыйЛС.Наименование = Номер;
    НовыйЛС.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("Автоматическое создание в %1"), ТекущаяДата());
	
	если ПроверитьУникальностьЛицевогоСчета(Номер) = ложь тогда
	  возврат "Номер ЛС не уникален";
	конецесли;	
	
	Попытка
	 НовыйЛС.Записать();
	 возврат "Создан";
	Исключение		
	 возврат "Не создан";
    КонецПопытки;

  иначе	
	возврат "У квартиры уже есть ЛС";
  конецесли;	
	
КонецФункции

&НаСервере
функция СоздатьОбъектЗданиеНаСервере(Улица, Дом, Корпус, Организация)

  объектЗдание = НайтиОбъектЗдания (Улица, Дом, Корпус);
  
  если объектЗдание = неопределено тогда
		
    НовоеЗдание = Справочники.бит_СписокЗданий.СоздатьЭлемент();
	
	НовоеЗдание.Улица       = Улица;
	НовоеЗдание.НомерДома   = Дом;
	если Корпус <> 0 тогда
	 НовоеЗдание.Корпус      = Корпус;
	конецесли;
	НовоеЗдание.Организация = Организация;
	НовоеЗдание.Прочее      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("Автоматическое создание в %1"), ТекущаяДата());
	
	Попытка
		НовоеЗдание.Записать();	
	Исключение		
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	возврат НовоеЗдание.Ссылка; 
	
  иначе	
	возврат объектЗдание.Ссылка; 
  конецесли;

конецфункции


функция СформироватьНомерЛС(Владелец, НомерКвартиры, ПрефиксЛС, Постфикс, ДлинаЛС)
	
 если ПравилаНумерацииЖил = "По номеру квартиры" тогда	
	
   колвоНулей = ДлинаЛС - СтрДлина(ПрефиксЛС) - СтрДлина(ПрефиксЛС) + 2;  
   строкаФормата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("ЧЦ=%1;ЧВН=;ЧГ=0"), колвоНулей);//колвоНулей);
   строкаНомера = Формат(НомерКвартиры, строкаФормата);
						
   возврат ПрефиксЛС + строкаНомера + Постфикс; 	  
   
 конецесли;  

 если ПравилаНумерацииЖил = "НомерДомаКвартира" или ПравилаНумерацииЖил = "Номер дома + Квартира" тогда	
	 
   ДлинаДома = СтрДлина(Строка(Владелец));	 
   колвоНулей = ДлинаЛС - СтрДлина(ПрефиксЛС) - СтрДлина(Постфикс) - ДлинаДома + 2;  
   строкаФормата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("ЧЦ=%1;ЧВН=;ЧГ=0"), колвоНулей);//колвоНулей);
   строкаНомера = Формат(НомерКвартиры, строкаФормата);
						
   возврат ПрефиксЛС + строка(Владелец) + строкаНомера + Постфикс; 	  
   
 конецесли;  

  если ПравилаНумерацииЖил = "Последовательная нумерация" тогда	
	 
  если Объект.ПоследнийРассчитанныйНомерЛС = 0 тогда 	
   Объект.ПоследнийРассчитанныйНомерЛС = Объект.НомерПервогоЛС;	    
  иначе
   Объект.ПоследнийРассчитанныйНомерЛС = Объект.ПоследнийРассчитанныйНомерЛС + 1;
  конецесли; 
 
  колвоНулей = ДлинаЛС - СтрДлина(ПрефиксЛС) - СтрДлина(Постфикс);// - СтрДлина(Строка(Объект.ПоследнийРассчитанныйНомерЛС));  
  строкаФормата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(("ЧЦ=%1;ЧВН=;ЧГ=0"), колвоНулей);//колвоНулей);
  строкаНомера = Формат(Объект.ПоследнийРассчитанныйНомерЛС, строкаФормата);
						
  возврат ПрефиксЛС + строкаНомера + Постфикс; 	  
   
 конецесли;  
	
конецфункции	

функция НайтиПоследнийНомерЛС()
	
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	бит_ЛицевыеСчета.Наименование КАК Наименование
                 |ИЗ
                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
				 //|ГДЕ
				 //|	бит_ЛицевыеСчета.Здание = &Здание";
  
  
//  запрос.УстановитьПараметр("Здание", Владелец);
  табЗапроса = запрос.Выполнить().Выгрузить(); 
  табЗапроса.Сортировать("Наименование Убыв");
  
  если табЗапроса.Количество() > 0 тогда
	номер = Число(табЗапроса[0].Наименование);	
	возврат номер + 1; 
  иначе	  
   возврат 0;	  
  конецесли;	  
	
конецфункции	

функция НайтиПоследнийПорядковыйНомерЛС()
	
  запрос = новый Запрос;
  запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	бит_ЛицевыеСчета.Наименование КАК Наименование
                 |ИЗ
                 |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
                 |ГДЕ
                 |	бит_ЛицевыеСчета.Наименование ПОДОБНО &Наименование";
				 //|ГДЕ
				 //|	бит_ЛицевыеСчета.Здание = &Здание";
  
  
//  запрос.УстановитьПараметр("Здание", Владелец);
  запрос.УстановитьПараметр("Наименование", строка(Объект.ПрефиксЛС) + "%");
  табЗапроса = запрос.Выполнить().Выгрузить(); 
//  табЗапроса.Сортировать("Наименование Убыв");
  
  числовойМассив = новый Массив;
  для каждого стр из табЗапроса цикл
	 числовойМассив.Добавить(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(стр.Наименование));
  конеццикла;	  
  
  СписокЗначений = Новый СписокЗначений;
  СписокЗначений.ЗагрузитьЗначения(числовойМассив);
  СписокЗначений.СортироватьПоЗначению();
  числовойМассив = СписокЗначений.ВыгрузитьЗначения();  
  
  если табЗапроса.Количество() > 0 тогда
	  
	номер = ПолучитьЧисловойНомерЛС(табЗапроса[0].Наименование);;	
	возврат номер + 1; 
  иначе	  
   возврат 1;	  
  конецесли;	  
	
конецфункции

Функция ПолучитьЧисловойНомерЛС(строкаНомера)

 длинаСтрокиНомера = СтрДлина(строкаНомера)- СтрДлина(Объект.ПрефиксЛС) + СтрДлина(Объект.ПостфиксЛС); 	
 строкаПорядковогоНомера = Сред(строкаНомера, (СтрДлина(Объект.ПрефиксЛС) + 1), длинаСтрокиНомера); 	
	
 возврат Число(строкаПорядковогоНомера);
КонецФункции // ПолучитьЧисловойНомерЛС()


&НаКлиенте
Процедура ПравилаНумерацииЖилНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Очистить();
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("Квартира","По номеру квартиры",, БиблиотекаКартинок.бит_ОПрограмме);
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("ПоПорядку","Последовательная нумерация",, БиблиотекаКартинок.бит_Реквизиты);
	Элементы.ПравилаНумерацииЖил.СписокВыбора.Добавить("НомерДомаКвартира","Номер дома + Квартира",, БиблиотекаКартинок.бит_ПодомовойУчет);
	ВыбранныйЭлемент = Неопределено;  
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПравилаНумерацииЖилНачалоВыбораЗавершение", ЭтотОбъект), Элементы.ПравилаНумерацииЖил.СписокВыбора, Элементы.ПравилаНумерацииЖил);

КонецПроцедуры

&НаКлиенте
Процедура ПравилаНумерацииЖилНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент = Неопределено Тогда
        
        Возврат;
        
    КонецЕсли;	
    
    ПравилаНумерацииЖилНаСервере(Строка(ВыбранныйЭлемент));
    
    //УправлениеВидимостью();

КонецПроцедуры

&НаСервере
Процедура ПравилаНумерацииЖилНаСервере(ВыбранныйЭлемент)

	ПравилаНумерацииЖил = ВыбранныйЭлемент;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьВсеКвартиры(Команда)
	Объект.СписокКвартир.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьВсеЗдания(Команда)
	Объект.СписокЗданий.Очистить();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
  Обработка =  РеквизитФормыВЗначение("Объект");
  Макет = Обработка.ПолучитьМакет("Макет"); 
  Возврат Макет;
КонецФункции


&НаСервере
функция ЗаписатьШапку (Макет, ТабДок)
	
  ОбластьШапки   = Макет.ПолучитьОбласть("Шапка");
  ОбластьШапки.Параметры.ДатаСоздания = ТекущаяДата();
  ОбластьШапки.Параметры.Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");

  ТабДок.Вывести(ОбластьШапки);

КонецФункции

&НаСервере
функция ЗаписатьПодвал (Всего, Макет, ТабДок)
	
  ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
  ОбластьПодвал.Параметры.Дата = ТекущаяДата();
  ОбластьПодвал.Параметры.Всего = Всего;

  ТабДок.Вывести(ОбластьПодвал);

КонецФункции


&НаСервере
функция ЗаписатьСтроку (Макет, ТабДок, структураВозврата)
  
  ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
  ОбластьСтроки.Параметры.Адрес = строка(структураВозврата.Здание.Улица) + ", " + строка(структураВозврата.Здание.НомерДома) + " " + структураВозврата.Здание.Корпус; 
  ОбластьСтроки.Параметры.Квартира = структураВозврата.Квартира;

  ТабДок.Вывести(ОбластьСтроки);

КонецФункции

функция ПроверитьУникальностьЛицевогоСчета(Наименование) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
//	|	бит_ЛицевыеСчета.Ссылка <> &Ссылка
//	|	И
	|   бит_ЛицевыеСчета.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",Наименование);
//	Запрос.УстановитьПараметр("Ссылка"            ,Ссылка);
	Если Не Запрос.Выполнить().Пустой() тогда
	 возврат ложь;	
    КонецЕсли;
  возврат истина;
Конецфункции	

&НаКлиенте
Процедура НайтиКвартирыПоАдресу(Команда)
	
	НайтиКвартирыПоАдресуНаСервере();

КонецПроцедуры

&НаСервере
Процедура НайтиКвартирыПоАдресуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_Квартиры.Ссылка КАК Ссылка,
	               |	бит_Квартиры.Владелец.Улица КАК Улица,
	               |	бит_Квартиры.Владелец.НомерДома КАК НомерДома,
	               |	бит_Квартиры.Владелец.Корпус КАК Корпус,
	               |	бит_Квартиры.НомерКвартиры КАК НомерКвартиры,
	               |	бит_СведенияОКвартире.ТипКвартиры КАК ТипКвартиры,
	               |	бит_СведенияОКвартире.СтатусКвартиры КАК СтатусКвартиры,
	               |	бит_ЛицевыеСчета.Наименование КАК ЛицевойСчет
	               |ИЗ
	               |	РегистрСведений.бит_СведенияОКвартире КАК бит_СведенияОКвартире
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |			ПО (бит_ЛицевыеСчета.Квартира = бит_Квартиры.Ссылка)
	               |		ПО бит_СведенияОКвартире.Квартира = бит_Квартиры.Ссылка
	               |ГДЕ
	               |	бит_Квартиры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.ТекущаяСсылка);
	
	табЗапроса = Запрос.Выполнить().Выгрузить();

	Объект.СписокКвартир.Очистить();
	для каждого стр из табЗапроса цикл
			
		  новыйКвартира = Объект.СписокКвартир.Добавить();	
		  новыйКвартира.Улица = стр.Улица;
		  новыйКвартира.Дом = стр.НомерДома;
		  новыйКвартира.Корпус = стр.Корпус;
		  новыйКвартира.НомерКвартиры = стр.НомерКвартиры;    		  
		  новыйКвартира.ТипКвартиры = стр.ТипКвартиры;
		  новыйКвартира.СтатусКвартиры = стр.СтатусКвартиры; 		  
		  новыйКвартира.ЛицевойСчет = стр.ЛицевойСчет;//СформироватьНомерЛС(Объект.ТекущийДом, текущийНомерКвартиры, Объект.ПрефиксЛС, Объект.ДлинаЛС);
		  новыйКвартира.СтатусЛС = "Существует";		 
			
	конеццикла;	 
	
	если табЗапроса.Количество() > 0 тогда
	 Объект.СписокКвартир.Сортировать("Улица, Дом, Корпус, НомерКвартиры");		
	 Объект.НомерПервойКвартиры = Объект.СписокКвартир[Объект.СписокКвартир.Количество()-1].НомерКвартиры + 1;
    иначе 
	 Объект.НомерПервойКвартиры = 1;
	конецесли; 

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеЗдания(Команда)
	
	массивВыбранных = новый массив;
	
	Для каждого стр из Объект.СписокЗданий Цикл
        Элементы.СписокЗданий.ВыделенныеСтроки.Добавить(стр.НомерСтроки - 1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиСозданныеНаСервере()
	
	строкаПоиска = "%Автоматическое создание в %"; 
	
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_Квартиры.Ссылка КАК Ссылка,
	               |	бит_Квартиры.Комментарий КАК Комментарий,
	               |	бит_Квартиры.Владелец КАК Владелец,
	               |	бит_Квартиры.НомерКвартиры КАК НомерКвартиры,
	               |	бит_Квартиры.Владелец.Улица КАК Улица,
	               |	бит_Квартиры.Владелец.НомерДома КАК НомерДома,
	               |	бит_Квартиры.Владелец.Корпус КАК Корпус,
	               |	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	               |	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	               |	бит_Квартиры.Владелец.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_Квартиры КАК бит_Квартиры
	               |		ПО бит_СведенияОКвартиреСрезПоследних.Квартира = бит_Квартиры.Ссылка
	               |ГДЕ
	               |	бит_Квартиры.Комментарий ПОДОБНО &Комментарий";
	
	запрос.УстановитьПараметр("Комментарий", строкаПоиска);   	
	
    табЗапроса = запрос.Выполнить().Выгрузить();
	
	списокВладельцевКвартир = новый массив;
	для каждого стр из табЗапроса цикл
		
	  датаСоздания = ПолучитьДатуСоздания (стр.Комментарий);	
	  
	  если датаСоздания <> '00010101000000' и ДатаВИнтервале(датаСоздания) тогда
		  
		  списокВладельцевКвартир.Добавить(стр.Владелец);
		  
	  конецесли;	  
		
    конеццикла;

	табЗапроса.Сортировать("Владелец, НомерКвартиры"); 	
	Объект.СписокКвартир.Очистить();
   
    для каждого стр из табЗапроса цикл	   
    
//	 для ном = 1 по объект.КолвоКвартир цикл		   
	  	  
	  новыйКвартира = Объект.СписокКвартир.Добавить();	
	  новыйКвартира.Улица = стр.Улица;
	  новыйКвартира.Дом = стр.НомерДома;
	  новыйКвартира.Корпус = стр.Корпус;
	  новыйКвартира.НомерКвартиры = стр.НомерКвартиры;    		  
	  новыйКвартира.ТипКвартиры = стр.ТипКвартиры;
	  новыйКвартира.СтатусКвартиры = стр.СтатусКвартиры; 		  
	  новыйКвартира.ЛицевойСчет = СформироватьНомерЛС(стр.Ссылка, стр.НомерКвартиры, Объект.ПрефиксЛС, Объект.ПостфиксЛС, Объект.ДлинаЛС);
	  новыйКвартира.СтатусЛС = "Создан";
		  
	  новыйДом = Объект.СписокЗданий.Добавить();	
	  новыйДом.Улица = стр.Улица;
	  новыйДом.Организация = стр.Организация;
	  новыйДом.Дом = стр.НомерДома;
	  новыйДом.Корпус = стр.Корпус;
	  новыйДом.Ссылка = НайтиОбъектЗдания(стр.Улица, новыйДом.Дом);
	  
//	 конеццикла;  	  
    конеццикла;	
	
	табЗданий = Объект.СписокЗданий.Выгрузить();
	табЗданий.Свернуть("Улица, Дом, Корпус, Организация, Ссылка");
	табЗданий.Сортировать("Улица, Дом, Корпус");

	Объект.СписокЗданий.Загрузить(табЗданий);
	
    Объект.СписокКвартир.Сортировать("Улица, Дом, Корпус, НомерКвартиры"); 	  
  	
КонецПроцедуры

Функция ДатаВИнтервале(датаСоздания)

	если датаСоздания >= Объект.НачальнаяДатаСоздания и датаСоздания <= Объект.КонечнаяДатаСоздания тогда
	 возврат истина;
    иначе
	 возврат ложь;
	конецесли;	

КонецФункции // ДатаВИнтервале()

Функция ПолучитьДатуСоздания(строкаДаты)

  позицияСтроки	= СтрДлина("Автоматическое создание в ");
  датаСтрока = Дата(СокрЛП(Сред(строкаДаты, позицияСтроки))); 
  датаСтрока = Формат(датаСтрока, "ДЛФ=Д");
  возврат СтроковыеФункцииКлиентСервер.СтрокаВДату(датаСтрока);  

КонецФункции // ПолучитьДатуСоздания()

&НаКлиенте
Процедура НайтиСозданные(Команда)
	Объект.СписокЗданий.Очистить();
	Объект.СписокКвартир.Очистить();
	НайтиСозданныеНаСервере();
КонецПроцедуры
